[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:9:45
 import ReviewTable from "main/components/Review/ReviewTable";
 
 // ✅ Named export for testing
-export function extractReview(reviewOrCell) {
-  return reviewOrCell?.row?.original ?? reviewOrCell;
-}
+export function extractReview(reviewOrCell) {}
 
 // ✅ Named export for testing
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
main/pages/MyReviews/MyReviewsIndexPage.js:10:10
 
 // ✅ Named export for testing
 export function extractReview(reviewOrCell) {
-  return reviewOrCell?.row?.original ?? reviewOrCell;
+  return reviewOrCell.row?.original ?? reviewOrCell;
 }
 
killedBy: MyReviewsIndexPage extractReview handles null row property correctly
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'row')"

      59 |   } else {
      60 |     stryCov_9fa48("87");
    > 61 |     return stryMutAct_9fa48("88") ? reviewOrCell?.row?.original && reviewOrCell : (stryCov_9fa48("88"), (stryMutAct_9fa48("90") ? reviewOrCell.row?.original : stryMutAct_9fa48("89") ? reviewOrCell?.ro

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:14:55
 }
 
 // ✅ Named export for testing
-export function useHandlers(navigate, deleteMutation) {
-  return {
-    handleEdit: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      navigate(`/reviews/edit/${review.id}`);
-    },
-    handleDelete: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      deleteMutation.mutate(review);
-    },
-  };
-}
+export function useHandlers(navigate, deleteMutation) {}
 
 // ✅ Default export for rendering the page
killedBy: MyReviewsIndexPage renders reviews in table
statusReason: TypeError: Cannot destructure property 'handleEdit' of 'useHandlers(...)' as it is undefined.

[Killed] StringLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:18:16
   return {
     handleEdit: (reviewOrCell) => {
       const review = extractReview(reviewOrCell);
-      navigate(`/reviews/edit/${review.id}`);
+      navigate(``);
     },
     handleDelete: (reviewOrCell) => {
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\/reviews\/edit\/\d+$/
Received string:  ""

[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:37:5
     status: _status,
   } = useBackend(
     ["/api/reviews/my"],
-    { method: "GET", url: "/api/reviews/my" },
+    {},
     [],
   );
killedBy: MyReviewsIndexPage calls useBackend with correct key and config
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "method": "GET",
-   "url": "/api/reviews/my",

[Killed] ArrowFunction
main/pages/MyReviews/MyReviewsIndexPage.js:42:5
   );
 
   const deleteMutation = useBackendMutation(
-    (review) => ({
-      url: `/api/reviews/${review.id}`,
-      method: "DELETE",
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: MyReviewsIndexPage deleteMutation is configured with correct URL and method
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "url": "/api/reviews/1"}
Received: undefined
