[Killed] ArrowFunction
main/components/Alias/AliasTable.js:11:38
   const testid = "AliasTable";
   const queryClient = useQueryClient();
 
-  const objectToAxiosParamsApprove = (user) => ({
-    // Stryker disable next-line all
-    url: `/api/currentUser/updateAliasModeration`,
-    method: "PUT",
-
-    /* Stryker disable all */ //not tested because it is mocked
-    params: {
-      id: user.id,
-      approved: true,
-    },
-    /* Stryker restore all */
-  });
+  const objectToAxiosParamsApprove = () => undefined;
 
   const approveMutation = useBackendMutation(objectToAxiosParamsApprove, {
killedBy: AliasTable tests The approve button approves the alias (toast)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias y9 for id 1 approved!"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/components/Alias/AliasTable.js:14:13
   const objectToAxiosParamsApprove = (user) => ({
     // Stryker disable next-line all
     url: `/api/currentUser/updateAliasModeration`,
-    method: "PUT",
+    method: "",
 
     /* Stryker disable all */ //not tested because it is mocked
killedBy: AliasTable tests The approve button approves the alias (toast)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias y9 for id 1 approved!"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
