[Killed] StringLiteral
main/components/Review/ReviewForm.js:5:64
 import { useForm } from "react-hook-form";
 import { useNavigate } from "react-router";
 
-function Review({ initialContents, submitAction, buttonLabel = "Create" }) {
+function Review({ initialContents, submitAction, buttonLabel = "" }) {
   // Stryker disable all
   const {
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Review/ReviewForm.js:27:24
           id="reviewerComments"
           type="text"
           isInvalid={Boolean(errors.reviewerComments)}
-          {...register("reviewerComments", {
+          {...register("", {
             required: "Reviewer Comment is required.",
             maxLength: {
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Review/ReviewForm.js:31:24
             required: "Reviewer Comment is required.",
             maxLength: {
               value: 255,
-              message: "Max length 255 characters for reviwer comments.",
+              message: "",
             },
           })}
killedBy: ReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters for reviwer comments./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Review/ReviewForm.js:43:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="dateItemServed">Date Item Served</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-dateItemServed"}
+          data-testid={testIdPrefix + ""}
           id="dateItemServed"
           type="date"
killedBy: ReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Review-dateItemServed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Review/ReviewForm.js:47:24
           id="dateItemServed"
           type="date"
           isInvalid={Boolean(errors.dateItemServed)}
-          {...register("dateItemServed", {
+          {...register("", {
             required: "Date Item Served is required.",
           })}
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Review/ReviewForm.js:48:23
           type="date"
           isInvalid={Boolean(errors.dateItemServed)}
           {...register("dateItemServed", {
-            required: "Date Item Served is required.",
+            required: "",
           })}
         />
killedBy: ReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Item Served is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Review/ReviewForm.js:52:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateItemServed?.message}
+          {errors.dateItemServed.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ArrowFunction
main/components/Review/ReviewForm.js:59:32
       <Form.Group className="mb-3">
         <Form.Label>Rating</Form.Label>
         <div>
-          {[1, 2, 3, 4, 5].map((star) => (
-            <Form.Check
-              inline
-              key={star}
-              type="radio"
-              label={`${star} ⭐`}
-              value={star}
-              id={`itemsStars-${star}`}
-              data-testid={`${testIdPrefix}-itemsStars-${star}`}
-              isInvalid={Boolean(errors.itemsStars)}
-              {...register("itemsStars", {
-                required: "Star rating is required.",
-              })}
-            />
-          ))}
+          {[1, 2, 3, 4, 5].map(() => undefined)}
         </div>
         <Form.Control.Feedback type="invalid">
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find a label with the text of: 1 ⭐

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrayDeclaration
main/components/Review/ReviewForm.js:59:12
       <Form.Group className="mb-3">
         <Form.Label>Rating</Form.Label>
         <div>
-          {[1, 2, 3, 4, 5].map((star) => (
+          {[].map((star) => (
             <Form.Check
               inline
killedBy: ReviewForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find a label with the text of: 1 ⭐

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Review/ReviewForm.js:67:28
               label={`${star} ⭐`}
               value={star}
               id={`itemsStars-${star}`}
-              data-testid={`${testIdPrefix}-itemsStars-${star}`}
+              data-testid={``}
               isInvalid={Boolean(errors.itemsStars)}
               {...register("itemsStars", {
killedBy: ReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Review-itemsStars-4"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
