[Killed] BooleanLiteral
main/components/Review/ReviewTable.js:6:17
 
 export default function ReviewTable({
   reviews,
-  userOptions = false,
+  userOptions = true,
   moderatorOptions = false,
   onEdit,
killedBy: ReviewTable Tests renders table with basic headers and no buttons
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th colspan="1" data-testid="ReviewTable-header-itemName" role="columnheader" style="cursor: pointer;" title="Toggle SortBy">Item Name<span data-testid="ReviewTable-header-itemName-sort-carets" /></th> instead

[Killed] BooleanLiteral
main/components/Review/ReviewTable.js:7:22
 export default function ReviewTable({
   reviews,
   userOptions = false,
-  moderatorOptions = false,
+  moderatorOptions = true,
   onEdit,
   onDelete,
killedBy: ReviewTable Tests renders table with basic headers and no buttons
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th colspan="1" data-testid="ReviewTable-header-Approve" role="columnheader">Approve<span data-testid="ReviewTable-header-Approve-sort-carets" /></th> instead

[Killed] StringLiteral
main/components/Review/ReviewTable.js:18:17
   const columns = [
     {
       Header: "Score",
-      accessor: "score",
+      accessor: "",
     },
     {
killedBy: ReviewTable Tests renders table with basic headers and no buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-score"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Review/ReviewTable.js:30:20
     },
   ];
 
-  if (userOptions) {
-    columns.push({
-      Header: "Item Name",
-      accessor: "itemName",
-    });
-    columns.push(ButtonColumn("Edit", "primary", onEdit, testid));
-    columns.push(ButtonColumn("Delete", "danger", onDelete, testid));
-  }
+  if (userOptions) {}
 
   if (moderatorOptions) {
killedBy: ReviewTable Tests renders with userOptions=true: shows Item Name and Edit/Delete buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:31:18
   ];
 
   if (userOptions) {
-    columns.push({
-      Header: "Item Name",
-      accessor: "itemName",
-    });
+    columns.push({});
     columns.push(ButtonColumn("Edit", "primary", onEdit, testid));
     columns.push(ButtonColumn("Delete", "danger", onDelete, testid));
killedBy: MyReviewsIndexPage renders reviews in table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:35:31
       Header: "Item Name",
       accessor: "itemName",
     });
-    columns.push(ButtonColumn("Edit", "primary", onEdit, testid));
+    columns.push(ButtonColumn("", "primary", onEdit, testid));
     columns.push(ButtonColumn("Delete", "danger", onDelete, testid));
   }
killedBy: ReviewTable Tests renders with userOptions=true: shows Item Name and Edit/Delete buttons
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:36:41
       accessor: "itemName",
     });
     columns.push(ButtonColumn("Edit", "primary", onEdit, testid));
-    columns.push(ButtonColumn("Delete", "danger", onDelete, testid));
+    columns.push(ButtonColumn("Delete", "", onDelete, testid));
   }
 
killedBy: ReviewTable Tests buttons have correct Bootstrap styles
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] BlockStatement
main/components/Review/ReviewTable.js:39:25
     columns.push(ButtonColumn("Delete", "danger", onDelete, testid));
   }
 
-  if (moderatorOptions) {
-    columns.push(ButtonColumn("Approve", "success", onApprove, testid));
-    columns.push(ButtonColumn("Reject", "danger", onReject, testid));
-  }
+  if (moderatorOptions) {}
 
   return <OurTable columns={columns} data={reviews} testid={testid} />;
killedBy: ReviewTable Tests renders with moderatorOptions=true: shows Approve/Reject buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Review/ReviewTable.js:40:31
   }
 
   if (moderatorOptions) {
-    columns.push(ButtonColumn("Approve", "success", onApprove, testid));
+    columns.push(ButtonColumn("", "success", onApprove, testid));
     columns.push(ButtonColumn("Reject", "danger", onReject, testid));
   }
killedBy: ReviewTable Tests renders with moderatorOptions=true: shows Approve/Reject buttons
statusReason: Error: A column ID (or string accessor) is required!
