[Killed] BlockStatement
src/main/pages/Moderate.js:19:69
     [],
   );
 
-  if (!currentUser.loggedIn || !hasRole(currentUser, "ROLE_ADMIN")) {
-    return <Navigate to="/" />;
-  }
+  if (!currentUser.loggedIn || !hasRole(currentUser, "ROLE_ADMIN")) {}
 
   // TODO: Replace this placeholder with the actual Reviews Table component when available
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
