[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:8:45
 import { toast } from "react-toastify";
 import ReviewTable from "main/components/Review/ReviewTable";
 
-export function extractReview(reviewOrCell) {
-  return reviewOrCell?.row?.original ?? reviewOrCell;
-}
+export function extractReview(reviewOrCell) {}
 
 export function useHandlers(navigate, deleteMutation) {
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
main/pages/MyReviews/MyReviewsIndexPage.js:9:10
 import ReviewTable from "main/components/Review/ReviewTable";
 
 export function extractReview(reviewOrCell) {
-  return reviewOrCell?.row?.original ?? reviewOrCell;
+  return reviewOrCell?.row?.original && reviewOrCell;
 }
 
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\/reviews\/edit\/\d+$/
Received string:  "/reviews/edit/undefined"

[Killed] OptionalChaining
main/pages/MyReviews/MyReviewsIndexPage.js:9:10
 import ReviewTable from "main/components/Review/ReviewTable";
 
 export function extractReview(reviewOrCell) {
-  return reviewOrCell?.row?.original ?? reviewOrCell;
+  return reviewOrCell?.row.original ?? reviewOrCell;
 }
 
killedBy: MyReviewsIndexPage extractReview returns input if row.original not present
statusReason: TypeError: Cannot read properties of undefined (reading 'original')

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:12:55
   return reviewOrCell?.row?.original ?? reviewOrCell;
 }
 
-export function useHandlers(navigate, deleteMutation) {
-  return {
-    handleEdit: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      navigate(`/reviews/edit/${review.id}`);
-    },
-    handleDelete: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      deleteMutation.mutate(review);
-    },
-  };
-}
+export function useHandlers(navigate, deleteMutation) {}
 
 export default function MyReviewsIndexPage() {
killedBy: MyReviewsIndexPage renders reviews in table
statusReason: TypeError: Cannot destructure property 'handleEdit' of 'useHandlers(...)' as it is undefined.

[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:13:10
 }
 
 export function useHandlers(navigate, deleteMutation) {
-  return {
-    handleEdit: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      navigate(`/reviews/edit/${review.id}`);
-    },
-    handleDelete: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      deleteMutation.mutate(review);
-    },
-  };
+  return {};
 }
 
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: TypeError: callback is not a function

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:14:35
 
 export function useHandlers(navigate, deleteMutation) {
   return {
-    handleEdit: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      navigate(`/reviews/edit/${review.id}`);
-    },
+    handleEdit: (reviewOrCell) => {},
     handleDelete: (reviewOrCell) => {
       const review = extractReview(reviewOrCell);
killedBy: MyReviewsIndexPage clicking Edit calls navigate with correct review id
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:18:37
       const review = extractReview(reviewOrCell);
       navigate(`/reviews/edit/${review.id}`);
     },
-    handleDelete: (reviewOrCell) => {
-      const review = extractReview(reviewOrCell);
-      deleteMutation.mutate(review);
-    },
+    handleDelete: (reviewOrCell) => {},
   };
 }
killedBy: MyReviewsIndexPage clicking Delete triggers deleteMutation
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrayDeclaration
main/pages/MyReviews/MyReviewsIndexPage.js:35:5
   } = useBackend(
     ["/api/reviews/userReviews"],
     { method: "GET", url: "/api/reviews/userReviews" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: MyReviewsIndexPage calls useBackend with correct key and config
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ArrowFunction
main/pages/MyReviews/MyReviewsIndexPage.js:39:5
   );
 
   const deleteMutation = useBackendMutation(
-    (review) => ({
-      url: `/api/reviews/reviewer`,
-      method: "DELETE",
-      params: {
-        id: review.id,
-      },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: MyReviewsIndexPage deleteMutation is configured with correct URL and method
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 1}, "url": "/api/reviews/reviewer"}
Received: undefined

[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:39:18
   );
 
   const deleteMutation = useBackendMutation(
-    (review) => ({
-      url: `/api/reviews/reviewer`,
-      method: "DELETE",
-      params: {
-        id: review.id,
-      },
-    }),
+    (review) => ({}),
     {
       onSuccess: () => {
killedBy: MyReviewsIndexPage deleteMutation is configured with correct URL and method
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {

[Killed] StringLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:40:12
 
   const deleteMutation = useBackendMutation(
     (review) => ({
-      url: `/api/reviews/reviewer`,
+      url: ``,
       method: "DELETE",
       params: {
killedBy: MyReviewsIndexPage deleteMutation is configured with correct URL and method
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:47:24
       },
     }),
     {
-      onSuccess: () => {
-        toast("Review deleted");
-      },
+      onSuccess: () => {},
     },
   );
killedBy: MyReviewsIndexPage clicking Delete triggers toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Review deleted"

Number of calls: 0

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:61:24
         <h1>My Reviews</h1>
         <ReviewTable
           reviews={reviews}
-          userOptions={true}
+          userOptions={false}
           moderatorOptions={false}
           onEdit={handleEdit}
killedBy: MyReviewsIndexPage renders reviews in table
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-1-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
